using Roots
using Roots: Newton
using LinearAlgebra
using FastGaussQuadrature
using ForwardDiff
D = ForwardDiff.derivative

L = 1.5
N = 4
n = 10
x = -L:L/N:L;

## Check ∂⁴ₓ u = 0
u(x) = [1, x, x^2, x^3];
∂u(x) = [0, 1, 2x, 3x^2];
∂²u(x) = [0, 0, 2, 6x];
∂³u(x) = [0, 0, 0, 6];
_β((a,b,c,d)) = 2*a^2*L+(2*b^2*L^3)/3+4/5*(b*c+a*d)*L^5+(2*c^2*L^7)/7+(2*d^2*L^9)/9

_M = [u(-L)';u(L)';∂u(-L)';∂u(L)'];
# _M = [∂²u(-L)';∂²u(L)';∂³u(-L)';∂³u(L)'];
r = rank(_M)
k = size(_M,1)-r
~,~,V = svd(_M)
α = V[:,end-k+1:end]
α_hat = map(t->t/sqrt(_β(t)),eachcol(α))

U = zeros(k,length(x))
for i ∈ 1:k
  map!(u -> u⋅α_hat[i], @view(U[i,:]), u.(x))
end
U

xg,wg=gausslegendre(100)
O = zeros(2,2);
_u = u.(xg*L)
for i ∈ 1:2
  for j ∈ 1:2
    O[i,j] = L*(wg ⋅ (map(u -> u⋅α_hat[i], _u) .* map(u -> u⋅α_hat[j], _u)))
  end
end
O
O ≈ I(n)

u.(x) .⋅ (α_hat[1],)
u.(x) .⋅ (α_hat[2],)
Broadcast()

λ, V = eigen(_M);
P = sortperm(abs.(λ));
all(@. abs(λ) > eps())
@. abs(λ)
_α1 = V[:,1]; _α1 = _α1 / sqrt(_β(_α1))
_α2 = V[:,2]; _α2 = _α2 / sqrt(_β(_α2))
_α3 = V[:,3]; _α3 = _α3 / sqrt(_β(_α3))



U = zeros(3,length(x))
U[1,:] = map(u -> u⋅_α1, u.(x))
U[2,:] = map(u -> u⋅_α2, u.(x))
U[3,:] = map(u -> u⋅_α3, u.(x))

xg,wg=gausslegendre(100)
L*(wg ⋅ (map(u -> u⋅_α1, u.(xg*L)) .* map(u -> u⋅_α3, u.(xg*L))))
L*(wg ⋅ (map(u -> u⋅_α2, u.(xg*L)) .* map(u -> u⋅_α2, u.(xg*L))))
L*(wg ⋅ (map(u -> u⋅_α3, u.(xg*L)) .* map(u -> u⋅_α3, u.(xg*L))))


u(x,μ,α) = @. α[1]*exp(μ*x) + α[2]*exp(-μ*x) + α[3]*cos(μ*x) + α[4]*sin(μ*x);
∂ₓ²u(x,μ,α) = @. μ^2*(α[1]*exp(μ*x) + α[2]*exp(-μ*x) - α[3]*cos(μ*x) - α[4]*sin(μ*x));

M(μ) = [
  exp(-L*μ)	   exp(L*μ)	       cos(L*μ)	  -sin(L*μ) #   u(−L)=0
  exp(L*μ)	   exp(-L*μ)	     cos(L*μ)	   sin(L*μ) #    u(L)=0
  exp(-L*μ)*μ	-exp(L*μ)*μ	   μ*sin(L*μ)	 μ*cos(L*μ) # ∂ₓu(−L)=0
  exp(L*μ)*μ	-exp(-L*μ)*μ  -μ*sin(L*μ)  μ*cos(L*μ) #  ∂ₓu(L)=0
]

β(μ,(a,b,c,d)) = 1/(2*μ)*(2*(4*a*b+c^2+d^2)*L*μ+4*(b*(c-d)+a*(c+d))*cosh(L*μ)*sin(L*μ)+
  (c-d)*(c+d)*sin(2*L*μ)+4*(a*(c-d)+b*(c+d))*cos(L*μ)*sinh(L*μ)+2*(a^2+b^2)*sinh(2*L*μ))

μ = zeros(n)
α = [zeros(4) for _ in 1:n];
for i in 1:n
  j = i + 1
  g(x) = (-1)^j*tan(x)+tanh(x);
  dg(x) = (-1)^j*sec(x)^2 + sech(x)^2;
  k = floor(j/2)
  approx_root = π*k-(-1)^j*π/4-exp(-2*π*k-π/2)
  μ[i] = find_zero((g,dg),approx_root,Newton())/L
  λ, V = eigen(M(μ[i]));
  P = sortperm(abs.(λ));
  @assert abs(λ[P[1]]) < 1e-10 "Expected |λ| ≈ 0, got $(abs(λ[P[1]]))"
  α[i] .= V[:,P[1]]
end

U = zeros(n,length(x))
∂ₓ²U = zeros(n,length(x));
α_hat = 1 ./ sqrt.(β.(μ,α)) .* α;
for i ∈ eachindex(μ)
  U[i,:] = u(x,μ[i],α_hat[i])
  ∂ₓ²U[i,:] = ∂ₓ²u(x,μ[i],α_hat[i])
end

#############
## TESTING
# Check orthonormality
xg,wg=gausslegendre(100)
O = zeros(n,n);
for i ∈ 1:n
  for j ∈ 1:n
    O[i,j] = L*(wg ⋅ (u(xg*L,μ[i],α_hat[i]).*u(xg*L,μ[j],α_hat[j])))
  end
end
O ≈ I(n)
# Check BCs
maximum(abs,U[:,1]) < 1e-10
maximum(abs,U[:,end]) < 1e-10
dU_ad = map(i->map(y->ForwardDiff.derivative(x->u(x,μ[i],α_hat[i]),y),x),eachindex(μ))
dU_ad = reduce(hcat,dU_ad)'
maximum(abs,dU_ad[:,1]) < 1e-10
maximum(abs,dU_ad[:,end]) < 1e-10
# Check derivative
d2U_ad = map(i->map(y->ForwardDiff.derivative(x->ForwardDiff.derivative(x->u(x,μ[i],α_hat[i]),x),y),x),eachindex(μ))
maximum(maximum.(abs,eachrow(∂ₓ²U) - d2U_ad)) < 1e-10
# Check PDE
d4U_ad = map(i->map(y->ForwardDiff.derivative(x->ForwardDiff.derivative(x->ForwardDiff.derivative(x->ForwardDiff.derivative(x->u(x,μ[i],α_hat[i]),x),x),x),y),x),eachindex(μ))
maximum(maximum.(abs,d4U_ad - eachrow(U).*μ.^4)) < 1e-10

# Ben code for L = 1.5; N = 4; n = 10; x = -L:L/N:L;
α_ben_code = [   0.066137044029449   0.066137044029449   0.995616282919325   0.000000000000000
   0.013934741167114  -0.013934741167114   0.000000000000001   0.999805804132588
   0.002896112678307   0.002896112678307  -0.999991612496179  -0.000000000000000
  -0.000602058044190   0.000602058044190  -0.000000000000001   0.999999637526046
  -0.000125155519918  -0.000125155519918  -0.999999984336096   0.000000000000001
  -0.000026017277699   0.000026017277699   0.000000000000000  -0.999999999323101
   0.000005408460662   0.000005408460662  -0.999999999970749  -0.000000000000000
  -0.000001124308511   0.000001124308511  -0.000000000000001   0.999999999998736
  -0.000000233720777  -0.000000233720777  -0.999999999999945   0.000000000000000
  -0.000000048585776   0.000000048585776  -0.000000000000002  -0.999999999999998];
reduce(hcat,α)' ≈ α_ben_code

ben_w = [  -0.000000000000012   0.162812470031209   0.498329411973147   0.798866571769327   0.916916671915498   0.798866571769345   0.498329411973177   0.162812470031241   0.000000000000011
   0.000000000000002  -0.375399737066279  -0.834188260095903  -0.705229398267292  -0.000000000000001   0.705229398267291   0.834188260095904   0.375399737066281   0.000000000000000
   0.000000000002584   0.599698053899500   0.791434476718537  -0.149339121733311  -0.811753591830650  -0.149339121726141   0.791434476721334   0.599698053893421  -0.000000000002586
  -0.000000000000001  -0.777513351909633  -0.329292085447185   0.798014647236673  -0.000000000000000  -0.798014647236672   0.329292085447186   0.777513351909632  -0.000000000000000
  -0.000000016916480   0.867401262992150  -0.304777238348686  -0.452723461962021   0.816700933453670  -0.452723422178666  -0.304777282553581   0.867401272326645   0.000000016916483
  -0.000000000000001  -0.845773749562366   0.750842515575802  -0.453892296648202   0.000000000000000   0.453892296648202  -0.750842515575802   0.845773749562366   0.000000000000002
  -0.000000000759679   0.709254527811152  -0.752747729470615   0.800892031772366  -0.816487748900682   0.800892031353176  -0.752747728648344   0.709254526617399   0.000000000759680
   0.000000000000001  -0.474122877861884   0.311731701446105  -0.159316400038165   0.000000000000001   0.159316400038164  -0.311731701446103   0.474122877861883  -0.000000000000001
  -0.000000022355027   0.173134001854502   0.312791614260997  -0.678884114631633   0.816496962592067  -0.678884149760097   0.312791672677497   0.173133939839876   0.000000022355028
   0.000000000000002   0.149943082310439  -0.754495818677630   0.678889645999073  -0.000000000000002  -0.678889645999071   0.754495818677631  -0.149943082310442  -0.000000000000001
];

ben_w
U

# # ## Equiv
# h(x) = -sech(x)+cos(x);
# dh(x) = sech(x)*tanh(x)-sin(x);
# μ2 = zeros(n)
# for i in 1:n # first two roots are zero
#   j = i + 1
#   k = floor(j/2)
#   approx_root = 2*(π*k-(-1)^j*π/4-exp(-2*π*k-π/2))
#   μ2[i] = find_zero((h,dh),approx_root,Newton())/2/L
# end
# μ-μ2